#ifndef _USER_GPIO_H_
#define _USER_GPIO_H_
#include "stdbool.h"
/***********************************************
** 作者: leo.liu
** 日期: 2022-11-9 10:15:48
** 说明: gpio初始化
***********************************************/
bool user_gpio_init(void);
/***********************************************
** 作者: leo.liu
** 日期: 2022-11-9 10:15:48
** 说明: 功放使能
***********************************************/
void amp_enable_set(bool en);
/***********************************************
** 作者: leo.liu
** 日期: 2022-11-9 10:15:48
** 说明: 警报通道控制
***********************************************/
void ad_ctrl_set(bool ctr0_en, bool ctr1_en, bool ctrl2_en);
/***********************************************
** 作者: leo.liu
** 日期: 2022-11-9 10:15:48
** 说明: 警报通道值
***********************************************/
float user_sensor_value_get(int ch);
#endif