#ifndef _USER_GPIO_H_
#define _USER_GPIO_H_
#include "stdbool.h"
/***********************************************
** 作者: leo.liu
** 日期: 2022-11-9 10:15:48
** 说明: gpio初始化
***********************************************/
bool user_gpio_init(void);
/***********************************************
** 作者: leo.liu
** 日期: 2022-11-9 10:15:48
** 说明: 功放使能
***********************************************/
void amp_enable_set(bool en);
/***********************************************
** 作者: leo.liu
** 日期: 2022-11-9 10:15:48
** 说明: 警报通道控制
***********************************************/
void ad_ctrl_set(bool ctr0_en, bool ctr1_en, bool ctrl2_en);

/***
** 日期: 2022-05-10 09:41
** 作者: leo.liu
** 函数作用：背光控制
** 返回参数说明：
***/
bool backlight_enable(bool en);
/***
** 日期: 2022-05-10 09:44
** 作者: leo.liu
** 函数作用：设置背光亮度
** 返回参数说明：
***/
bool backlight_brightness_set(int per);
/***********************************************
** 作者: leo.liu
** 日期: 2022-11-9 10:15:48
** 说明: 警报通道值
***********************************************/
float user_sensor_value_get(int ch);

/************************************************************
** 函数说明: door1特殊锁控制
** 作者: xiaoxiao
** 日期: 2023-05-11 14:37:14
** 参数说明: 
** 注意事项: 
************************************************************/
void door1_lock1_pin_ctrl(bool en);

/************************************************************
** 函数说明: 警报电源输出控制
** 作者: xiaoxiao
** 日期: 2023-07-19 09:06:16
** 参数说明: 
** 注意事项: 
************************************************************/
void alarm_power_out_ctrl(bool en);
#endif